In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = Series([4,7,-5,3],index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.d

4

In [11]:
obj2['d']

4

In [12]:
obj2['d'] = 6

In [13]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 *2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'k' in obj2

False

In [19]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [20]:
obj3 = Series(sdata)

In [21]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
states = ['California','Ohio','Oregon','Texas']

In [24]:
obj4 = Series(sdata,index=states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3,obj4

(Ohio      35000
 Oregon    16000
 Texas     71000
 Utah       5000
 dtype: int64, California        NaN
 Ohio          35000.0
 Oregon        16000.0
 Texas         71000.0
 dtype: float64)

In [30]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'

In [32]:
obj4.index.name = 'state'

In [33]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [39]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2003,2004],'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [40]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2003
4  2.9  Nevada  2004

In [41]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2003  Nevada  2.4
4  2004  Nevada  2.9

In [43]:
frame2 = DataFrame(data, columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])

In [44]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2003  Nevada  2.4  NaN
five   2004  Nevada  2.9  NaN

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [48]:
frame2['year']

one      2000
two      2001
three    2002
four     2003
five     2004
Name: year, dtype: int64

In [49]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [50]:
frame2['debt']=16.5

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2003  Nevada  2.4  16.5
five   2004  Nevada  2.9  16.5

In [52]:
frame2['debt']=np.arange(5.)

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2003  Nevada  2.4   3.0
five   2004  Nevada  2.9   4.0

In [54]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [55]:
frame2['debt']=val

In [56]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2003  Nevada  2.4  -1.5
five   2004  Nevada  2.9  -1.7

In [57]:
frame2['eastern'] = frame2.state == 'Ohio'

In [58]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2003  Nevada  2.4  -1.5   False
five   2004  Nevada  2.9  -1.7   False

In [63]:
del frame2['eastern']

In [65]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
frame3 = frame2.copy() # all modifs made in queries will be reflected in orig DataFrame. User copy() if want to keep orig one

In [71]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [73]:
frame3 = DataFrame(pop)

In [74]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [75]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [76]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [77]:
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}

In [78]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [79]:
frame3.index.name ='year';frame3.columns.name ='state'

In [80]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [81]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [82]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2003, 'Nevada', 2.4, -1.5],
       [2004, 'Nevada', 2.9, -1.7]], dtype=object)

In [83]:
obj = Series(range(3),index=['a','b','c'])

In [84]:
index = obj.index

In [85]:
index

Index(['a', 'b', 'c'], dtype='object')

In [86]:
index[1:]

Index(['b', 'c'], dtype='object')

In [87]:
index[1]='d' # index is immutable

TypeError: Index does not support mutable operations

In [88]:
index = pd.Index(np.arange(3))

In [89]:
obj2 = Series([-1.5,-2.5,0],index=index)

In [90]:
obj2.index is index

True

In [91]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [94]:
'Ohio' in frame3.columns

True

In [95]:
2003 in frame3.index

False

In [96]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [97]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [98]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [99]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [100]:
obj2 = obj.reindex(['a','b','c','d','e'],fill_value=0)

In [101]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [102]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [103]:
obj3.reindex(range(6),method='ffill') # fill the next solt with current value

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [105]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                  columns=['ohio','Texas','California'])

In [106]:
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [107]:
frame2 = frame.reindex(['a','b','c','d'])

In [108]:
frame2

   ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [109]:
states = ['Texas','Utah','California']

In [110]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [111]:
frame.reindex(index=['a','b','c','d'],method='ffill', #'b' is now filled by value from previous position: 'a' 
             columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [113]:
frame.reindex(index=['a','b','c','d'],method='bfill', #'b' is now filled by value from next position: 'c'
             columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      4   NaN           5
d      7   NaN           8

In [115]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [116]:
obj = Series(np.arange(5),index=['a','b','c','d','e'])

In [117]:
new_obj = obj.drop('c')

In [118]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [119]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

In [120]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [121]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [125]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [126]:
obj = Series(np.arange(4),index=['a','b','c','d'])

In [127]:
obj['b']

1

In [128]:
obj[1]

1

In [129]:
obj[2:4] #Series index in inclusive

c    2
d    3
dtype: int32

In [130]:
obj[['b','c','d']]

b    1
c    2
d    3
dtype: int32

In [131]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [132]:
obj[obj<2]

a    0
b    1
dtype: int32

In [133]:
obj['b':'c']

b    1
c    2
dtype: int32

In [134]:
obj['b':'c'] =5

In [135]:
obj

a    0
b    5
c    5
d    3
dtype: int32

In [136]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [137]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [138]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [139]:
data[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [140]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [141]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [143]:
data[data<5]=0

In [144]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [146]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [147]:
data.ix[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [150]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [151]:
data.get_value('Utah','two')

9

In [159]:
data.ix['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [160]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [161]:
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [162]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [163]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [164]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [165]:
df1 = DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),
               index=['Ohio','Texas','Colorado'])

In [167]:
df2 = DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])

In [168]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [169]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [170]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [171]:
df1 = DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

In [172]:
df2 = DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [173]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [174]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [175]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [176]:
arr = np.arange(12).reshape((3,4))

In [177]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [178]:
arr[0]

array([0, 1, 2, 3])

In [179]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [182]:
frame = DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [183]:
series = frame.ix[0]

In [184]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [186]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [187]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [188]:
series2 =Series(range(3),index=list('bef'))

In [189]:
series2

b    0
e    1
f    2
dtype: int32

In [190]:
frame - series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [191]:
series3 = frame['d']

In [192]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [193]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [194]:
frame.sub(series3,axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [196]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [203]:
frame

               b         d         e
Utah   -0.070187 -0.000960 -0.885192
Ohio    0.094801  1.392382 -0.443776
Texas  -0.560014 -0.366739 -0.370039
Oregon  0.506810 -1.896967 -1.135196

In [199]:
f = lambda x: x.max() - x.min()

In [200]:
frame.apply(f)

b    1.066824
d    3.289349
e    0.765157
dtype: float64

In [204]:
frame.apply(f,axis=1)

Utah      0.884232
Ohio      1.836158
Texas     0.193275
Oregon    2.403777
dtype: float64

In [206]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

In [207]:
frame.apply(f)

            b         d         e
min -0.560014 -1.896967 -1.135196
max  0.506810  1.392382 -0.370039

In [209]:
format = lambda x:'%.2f' % x

In [210]:
frame.applymap(format) # apply map for each element in dataframe

            b      d      e
Utah    -0.07  -0.00  -0.89
Ohio     0.09   1.39  -0.44
Texas   -0.56  -0.37  -0.37
Oregon   0.51  -1.90  -1.14

In [212]:
frame['e'].map(format) # map() is in Series level, DataFrame does not have a map() method, only applymap()

Utah      -0.89
Ohio      -0.44
Texas     -0.37
Oregon    -1.14
Name: e, dtype: object

In [221]:
obj = Series(range(4),index=list('dabc'))

In [222]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [223]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                 columns=list('dabc'))

In [224]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [225]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [227]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [228]:
obj = Series([4,7,-3,2])

In [230]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [231]:
obj=Series([4,np.nan,7,np.nan,-3,2])

In [232]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [233]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [234]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [236]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [237]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [238]:
obj = Series([7,-5,7,4,2,0,4])

In [239]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [241]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [242]:
obj.rank(ascending=False,method='max')
"""
method list:
1, 'average', by default, identical values will share rank, ex: 4,4 ==> rank 6.5, 6.5
2, 'min', minimum ranking, ex: 4,4 ==> rank 6,6
3, 'max', maximum ranking, ex: 4,4 ==> rank 7,7
4, 'first', for identical values, first one takes higher rank, ex: 4,4 ==> rank 6,7
"""

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [243]:
obj.rank(ascending=False,method='min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [244]:
obj = Series(range(5),index=list('aabbc'))

In [245]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [246]:
obj.index.is_unique

False

In [247]:
obj['a']

a    0
a    1
dtype: int32

In [249]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [250]:
df

          0         1         2
a -0.209803 -0.659760  1.417901
a -0.403863  0.937758  1.299557
b  0.397310  1.435962  0.143475
b -0.490345  0.421730  0.286763

In [251]:
df.ix['a']

          0         1         2
a -0.209803 -0.659760  1.417901
a -0.403863  0.937758  1.299557

In [252]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75,-1.3]],
              index=['a','b','c','d'],
              columns=['one','two'])

In [253]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [254]:
df.sum() # exclude automatically NAN

one    9.25
two   -5.80
dtype: float64

In [255]:
df.sum(axis=1) # exclude automatically NAN

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [256]:
df.mean(axis=1,skipna=False) # automatical exclusion is disallowed

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [257]:
df.idxmax() #max value by index, same for idxmin()

one    b
two    d
dtype: object

In [258]:
df.cumsum() #cumulative sum

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [259]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [260]:
obj = Series(['a','a','b','c','d']*4)

In [262]:
obj.describe()

count     20
unique     4
top        a
freq       8
dtype: object

In [276]:
import pandas_datareader.data as pdr

all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = pdr.get_data_google(ticker,'1/1/2010','1/1/2017')
    
price = DataFrame({tic:data['Close']
                  for tic,data in all_data.items()})
volume = DataFrame({tic:data['Volume']
                   for tic,data in all_data.items()})

In [280]:
returns = price.pct_change()

In [281]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-12-23  0.001978 -0.001706 -0.002095 -0.004878
2016-12-27  0.006351  0.002076  0.002579  0.000633
2016-12-28 -0.004264 -0.008212 -0.005684 -0.004583
2016-12-29 -0.000257 -0.002879  0.002467 -0.001429
2016-12-30 -0.007796 -0.014014 -0.003661 -0.012083

In [282]:
returns.MSFT.corr(returns.IBM) # correlation

0.49689842881643831

In [283]:
returns.MSFT.cov(returns.IBM) # covariance

8.7737060675199718e-05

In [284]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.411566  0.384800  0.390018
GOOG  0.411566  1.000000  0.402663  0.471219
IBM   0.384800  0.402663  1.000000  0.496898
MSFT  0.390018  0.471219  0.496898  1.000000

In [285]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000273  0.000107  0.000077  0.000094
GOOG  0.000107  0.000248  0.000077  0.000108
IBM   0.000077  0.000077  0.000146  0.000088
MSFT  0.000094  0.000108  0.000088  0.000214

In [286]:
returns.corrwith(returns.IBM)

AAPL    0.384800
GOOG    0.402663
IBM     1.000000
MSFT    0.496898
dtype: float64

In [289]:
returns.corrwith(volume)

AAPL   -0.072397
GOOG    0.062361
IBM    -0.203014
MSFT   -0.092070
dtype: float64

In [290]:
returns.corrwith(volume,axis=1)

Date
2010-01-04         NaN
2010-01-05    0.799154
2010-01-06   -0.905884
2010-01-07    0.282126
2010-01-08   -0.862020
2010-01-11    0.377749
2010-01-12   -0.930585
2010-01-13    0.903636
2010-01-14   -0.740787
2010-01-15   -0.833061
2010-01-19    0.897532
2010-01-20    0.784098
2010-01-21   -0.764855
2010-01-22   -0.995321
2010-01-25    0.991557
2010-01-26    0.904426
2010-01-27    0.994446
2010-01-28   -0.873033
2010-01-29   -0.953310
2010-02-01   -0.389948
2010-02-02    0.026252
2010-02-03    0.996390
2010-02-04   -0.997901
2010-02-05    0.980239
2010-02-08    0.999821
2010-02-09   -0.026160
2010-02-10   -0.496498
2010-02-11    0.780103
2010-02-12    0.456231
2010-02-16    0.765638
                ...
2016-11-17    0.262939
2016-11-18    0.279585
2016-11-21    0.080987
2016-11-22    0.737249
2016-11-23   -0.106778
2016-11-25    0.082930
2016-11-28   -0.997219
2016-11-29    0.311795
2016-11-30    0.234018
2016-12-01    0.152106
2016-12-02   -0.020842
2016-12-05   -0.383150
2016-12-06    0.403831
2016-12-07   -0.307840
2016-12-08   -0.097881
2016-12-09    0.503174
2016-12-12    0.037599
2016-12-13    0.433645
2016-12-14   -0.669519
2016-12-15    0.689218
2016-12-16    0.871598
2016-12-19    0.799149
2016-12-20   -0.775514
2016-12-21    0.993888
2016-12-22   -0.158147
2016-12-23    0.194015
2016-12-27    0.565169
2016-12-28    0.818942
2016-12-29   -0.043206
2016-12-30   -0.055238
dtype: float64

In [291]:
obj = Series(list('cadaabbcc'))

In [292]:
uniques = obj.unique()

In [293]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [294]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [295]:
pd.value_counts(obj.values,sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [296]:
mask = obj.isin(['b','c'])

In [297]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [298]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [307]:
data = DataFrame({'Qu1':[1,2,3,3,4],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})

In [308]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    2    3    5
2    3    1    2
3    3    2    4
4    4    3    4

In [309]:
result =data.apply(pd.value_counts).fillna(0)

In [310]:
result # index number = each value, number in each column : how many times the value appears in the column

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  2.0  2.0  0.0
4  1.0  0.0  2.0
5  0.0  0.0  1.0

In [311]:
string_data = Series(['aaaa','bbbb',np.nan,'cccc'])

In [312]:
string_data

0    aaaa
1    bbbb
2     NaN
3    cccc
dtype: object

In [313]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [314]:
string_data[0]=None

In [316]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [317]:
string_data.fillna(method='ffill')

0    None
1    bbbb
2    bbbb
3    cccc
dtype: object

In [318]:
string_data.fillna(method='bfill')

0    bbbb
1    bbbb
2    cccc
3    cccc
dtype: object

In [319]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])

In [320]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [321]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [323]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [324]:
data = DataFrame([[1,6.5,3],[1,NA,NA],
                 [NA,NA,NA],[NA,6.5,3]])

In [327]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [328]:
cleaned = data.dropna(how='all') # only drop all NA rows
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [329]:
data[4]=NA

In [330]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [331]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [332]:
df = DataFrame(np.random.randn(7,3))

In [334]:
df.ix[:4,1] = NA;df.ix[:2,2]=NA

In [335]:
df

          0         1         2
0 -0.939988       NaN       NaN
1 -0.124551       NaN       NaN
2 -0.942486       NaN       NaN
3 -0.445756       NaN -1.887566
4 -0.382761       NaN -1.136696
5 -0.302258 -0.829916 -0.456053
6 -2.110136  1.040270  0.000429

In [340]:
df.dropna(thresh=3) # thresh 3 means show only the part that all 3 columns contain non-na values

          0         1         2
5 -0.302258 -0.829916 -0.456053
6 -2.110136  1.040270  0.000429

In [341]:
df.fillna(0)

          0         1         2
0 -0.939988  0.000000  0.000000
1 -0.124551  0.000000  0.000000
2 -0.942486  0.000000  0.000000
3 -0.445756  0.000000 -1.887566
4 -0.382761  0.000000 -1.136696
5 -0.302258 -0.829916 -0.456053
6 -2.110136  1.040270  0.000429

In [345]:
df.fillna({1:0.5,3:-1}) # all na values in column 1 will be replaced by 0.5 and those in column 3 by -1

          0         1         2
0 -0.939988  0.500000 -1.000000
1 -0.124551  0.500000 -1.000000
2 -0.942486  0.500000 -1.000000
3 -0.445756  0.500000 -1.887566
4 -0.382761  0.500000 -1.136696
5 -0.302258 -0.829916 -0.456053
6 -2.110136  1.040270  0.000429

In [346]:
_=df.fillna(0,inplace=True) # inplace = True will modify original dataframe

In [347]:
df

          0         1         2
0 -0.939988  0.000000  0.000000
1 -0.124551  0.000000  0.000000
2 -0.942486  0.000000  0.000000
3 -0.445756  0.000000 -1.887566
4 -0.382761  0.000000 -1.136696
5 -0.302258 -0.829916 -0.456053
6 -2.110136  1.040270  0.000429

In [348]:
df = DataFrame(np.random.randn(6,3))

In [349]:
df.ix[2:,1] = NA; df.ix[4:,2] = NA

In [350]:
df

          0         1         2
0  1.454166 -0.634235 -0.570109
1 -1.079875 -0.689928  0.415224
2 -0.360052       NaN -1.343615
3  1.022685       NaN  0.364594
4  0.732352       NaN       NaN
5  0.485296       NaN       NaN

In [351]:
df.fillna(method='ffill')

          0         1         2
0  1.454166 -0.634235 -0.570109
1 -1.079875 -0.689928  0.415224
2 -0.360052 -0.689928 -1.343615
3  1.022685 -0.689928  0.364594
4  0.732352 -0.689928  0.364594
5  0.485296 -0.689928  0.364594

In [352]:
df.fillna(method='ffill',limit=2) # fill up to 2 NA per column

          0         1         2
0  1.454166 -0.634235 -0.570109
1 -1.079875 -0.689928  0.415224
2 -0.360052 -0.689928 -1.343615
3  1.022685 -0.689928  0.364594
4  0.732352       NaN  0.364594
5  0.485296       NaN  0.364594

In [353]:
data = Series([1,NA,3.5,NA,7])

In [354]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Hierarchical Indexing

In [361]:
data = Series(np.random.randn(10),
             index=[list('aaabbbccdd'),[1,2,3,1,2,3,1,2,2,3]])

In [362]:
data

a  1    1.008100
   2    0.408387
   3    0.289917
b  1    0.433659
   2    0.314310
   3    2.061430
c  1   -0.238656
   2    0.640610
d  2    0.815231
   3   -1.124224
dtype: float64

In [363]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [364]:
data['b']

1    0.433659
2    0.314310
3    2.061430
dtype: float64

In [368]:
data.ix[['b','d']]

b  1    0.433659
   2    0.314310
   3    2.061430
d  2    0.815231
   3   -1.124224
dtype: float64

In [369]:
data[:,2]

a    0.408387
b    0.314310
c    0.640610
d    0.815231
dtype: float64

In [370]:
data

a  1    1.008100
   2    0.408387
   3    0.289917
b  1    0.433659
   2    0.314310
   3    2.061430
c  1   -0.238656
   2    0.640610
d  2    0.815231
   3   -1.124224
dtype: float64

In [371]:
data.unstack() # turns into a dataframe

          1         2         3
a  1.008100  0.408387  0.289917
b  0.433659  0.314310  2.061430
c -0.238656  0.640610       NaN
d       NaN  0.815231 -1.124224

In [372]:
data.unstack().stack() # rebuild the Series with multiIndex

a  1    1.008100
   2    0.408387
   3    0.289917
b  1    0.433659
   2    0.314310
   3    2.061430
c  1   -0.238656
   2    0.640610
d  2    0.815231
   3   -1.124224
dtype: float64

In [373]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index=[list('aabb'),[1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],
                          ['Green','Red','Green']])

In [374]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [375]:
frame.index.names =['key1','key2']

In [377]:
frame.columns.names=['state','color']

In [378]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [379]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [380]:
frame.swaplevel('key1','key2') # switch names but values stay the same

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [381]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [382]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [385]:
frame.sum(level='key2') # means, key1 a + key1 b

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [386]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [388]:
frame.sum(level='state',axis=1)

state      Colorado  Ohio
key1 key2
a    1            2     1
     2            5     7
b    1            8    13
     2           11    19

In [389]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})

In [390]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [391]:
frame2 = frame.set_index(['c','d'])

In [392]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [393]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [394]:
frame2.reset_index() # set_index <> reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [395]:
ser = Series(np.arange(3))

In [399]:
ser2 = ser.copy()

In [400]:
ser2.index = ['a','b','c']

In [402]:
ser2[-1]

2

In [405]:
ser.ix[:1]

0    0
1    1
dtype: int32

In [406]:
ser3 = Series(range(3),index=[-5,1,3])

In [410]:
ser3

-5    0
 1    1
 3    2
dtype: int32

In [414]:
ser3.loc[-5:1] # loc[] works only with index label, and works for multi-selection

-5    0
 1    1
dtype: int32

In [416]:
ser3.iloc[:2] # iloc[] works with index position,int only, and works for multi-selection

-5    0
 1    1
dtype: int32

In [420]:
ser3.at[-5] # similar to loc[] but works only for single-selection

0

In [419]:
ser3.iat[2] # similar to iloc[] but works only for single-selection

2